20240919183750-portfolio_4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-29 Sun 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio 4</title>
<meta name="author" content="chameko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio 4</h1>
<p>
Machine learning is fascinating in how much of it attempts to reflect natures and our reality. The very basics concepts of a deep learning network are the same as those found in our brains. We have a bunch of "neurons" connected together via pathways and together they are able to perform pattern recognition and reasoning. I was surprised by the elegant simplicity of the concept. Machine learning has always been this magic that simply makes the models like Chat-GPT perform seemingly impossible feats but now I feel as though the curtain has been lifted a tad.
</p>

<p>
It amazes me how some of our most effective designs and ideas come from nature. When reading <a href="http://neuralnetworksanddeeplearning.com/index.html">http://neuralnetworksanddeeplearning.com/index.html</a>, the author talked about how when making a model, rather than just have lots of neurons and layers, its better to try and create a model that will "reason" the same way a person would. In the case of the handwriting example, each layer breaks down the number into smaller components and then uses that to identify them. If I ever want to do further research into AI, I'll keep this advice in mind when developing future models and for ways to improve my current one.
</p>

<p>
One of the tasks I want to accomplish is to create a simple machine learning model, such as the handwriting identifier mentioned previously, to gain a better understanding of both how to implement AI using frameworks such as pytorch (the library my supervisor recommended) and because I learn better when I put ideas into practise as to pure academic research.
</p>

<p>
Due to technology reasons, I can't video chat with my supervisor using my laptop and am providing weekly emails instead. While e-mail is an adequate form of communication I find face-to-face conversations allow me to better ask follow up questions and improves communication.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: chameko</p>
<p class="date">Created: 2024-09-29 Sun 23:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
